Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lpa/source/cy_lpa_wifi_pf_ol.c
/***************************************************************************//**
* \file cy_lpa_wifi_pf_ol.c
* \version 1.0
*
* \brief
* Low Power Offload Packet Filter Assist Implementation
*
********************************************************************************
* \copyright
* Copyright 2020, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "string.h"
#include "cy_lpa_wifi_ol_debug.h"
#include "cy_lpa_wifi_ol.h"
#include "cy_lpa_wifi_ol_priv.h"
#include "cy_lpa_wifi_pf_ol.h"
#include "cy_lpa_wifi_result.h"

#if !defined(OLM_NO_HARDWARE)
#define USE_HW
#endif

#ifdef USE_HW
#include "lwip/ip.h"
#include "whd_sdpcm.h"
#include "whd_wifi_api.h"
#include "whd_wlioctl.h"
#include "whd_endian.h"
#endif

#ifdef __cplusplus
extern "C" {
#endif

#define MAX_BITS_IN_PORTNUM 16  /* Portnum is 16 bits */

static ol_init_t cylpa_pf_ol_init;
static ol_deinit_t cylpa_pf_ol_deinit;
static ol_pm_t cylpa_pf_ol_pm;

const ol_fns_t pf_ol_fns =
{
    .init = cylpa_pf_ol_init,
    .deinit = cylpa_pf_ol_deinit,
    .pm = cylpa_pf_ol_pm,
};


/*******************************************************************************
* Function Prototypes
*******************************************************************************/

static int cylpa_create_portnum_range_mask(cy_pf_ol_cfg_t *pf_cfg, uint16_t *pattern, uint16_t *mask);
static int cylpa_create_single_portnum_mask(cy_pf_ol_cfg_t *pf_cfg, uint16_t *pattern, uint16_t *mask);
static int cylpa_create_port_filter(whd_t *whd, cy_pf_ol_cfg_t *pf_cfg, uint16_t pattern, uint16_t mask);
static int cylpa_create_ethtype_filter(whd_t *whd, cy_pf_ol_cfg_t *pf_cfg);
static int cylpa_create_ip_filter(whd_t *whd, cy_pf_ol_cfg_t *pf_cfg);

static int cylpa_sign_extend(int val, unsigned width);
static int cylpa_bitwidth(int val);
static int cylpa_dump_filters_stats(whd_t *whd, cy_pf_ol_cfg_t *pf_cfg);
#ifdef TESTING
static void cylpa_run_pf_test(unsigned int pattern, unsigned int mask);
#endif

#ifdef USE_HW
static int cylpa_print_packet_filter_stats(whd_t *whd, uint8_t filter_id);
#ifdef DEBUG
static void cylpa_print_pat_and_mask(uint8_t id, int mask_len, uint8_t *mask, uint8_t *pat);
#endif
#endif


/*******************************************************************************
 * Function Name: cylpa_pf_ol_init
 ****************************************************************************//**
 *
 * Packet filter init function.
 *
 * \param ol
 * The pointer to the ol structure.
 *
 * \param info
 * The pointer to the ol_info_t structure \ref ol_info_t.
 *
 * \param cfg
 * The pointer to the configuration.
 *
 * \return
 * Returns the execution result
 *
 ********************************************************************************/
static int cylpa_pf_ol_init(void *ol, ol_info_t *info, const void *cfg)
{
    pf_ol_t *ctxt = (pf_ol_t *)ol;
    memset(ctxt, 0, sizeof(pf_ol_t) );

    ctxt->cfg  = (cy_pf_ol_cfg_t *)cfg;
    ctxt->whd  = info->whd;

    cy_pf_ol_cfg_t *pf_cfg;

    for (pf_cfg = ctxt->cfg; pf_cfg->feature != CY_PF_OL_FEAT_LAST; pf_cfg++)
    {
        switch (pf_cfg->feature)
        {
            case CY_PF_OL_FEAT_PORTNUM:
            {
                uint16_t pattern;
                uint16_t mask;
                if ( (!IS_POWER(pf_cfg->u.pf.portnum.portnum) ) || (!IS_POWER( (pf_cfg->u.pf.portnum.range + 1) ) ) ||
                     (pf_cfg->u.pf.portnum.range == 0) )
                {
                    cylpa_create_single_portnum_mask(pf_cfg, &pattern, &mask);
                    OL_LOG_PF(LOG_OLA_LVL_DEBUG, "Creating Single Port filter ID: %d Port: %d ",
                              pf_cfg->id, pf_cfg->u.pf.portnum.portnum);
                }
                else
                {
                    cylpa_create_portnum_range_mask(pf_cfg, &pattern, &mask);
                    OL_LOG_PF(LOG_OLA_LVL_DEBUG, "Creating Port Range filter ID: %d, Range %d - %d ", pf_cfg->id,
                              pf_cfg->u.pf.portnum.portnum, pf_cfg->u.pf.portnum.portnum + pf_cfg->u.pf.portnum.range);
                }
                cylpa_create_port_filter(ctxt->whd, pf_cfg, pattern, mask);
#ifdef TESTING
                cylpa_run_pf_test(pattern, mask);
#endif
                break;
            }
            case CY_PF_OL_FEAT_ETHTYPE:
                cylpa_create_ethtype_filter(ctxt->whd, pf_cfg);
                break;
            case CY_PF_OL_FEAT_IPTYPE:
                cylpa_create_ip_filter(ctxt->whd, pf_cfg);
                break;
            case CY_PF_OL_FEAT_LAST:
                /* Satisfy compiler, never executed */
                break;
            default:
                OL_LOG_PF(LOG_OLA_LVL_ERR, "%s: Unknown Packet Filter feature: %d\n", __func__, pf_cfg->feature);
                break;
        }
    }

#ifdef USE_HW
    /*
     * Enable any wake filters
     */
    for (pf_cfg = ctxt->cfg; pf_cfg->feature != CY_PF_OL_FEAT_LAST; pf_cfg++)
    {
        if (pf_cfg->bits & CY_PF_ACTIVE_WAKE)
        {
            if (whd_pf_enable_packet_filter(ctxt->whd, pf_cfg->id) != WHD_SUCCESS)
            {
                OL_LOG_PF(LOG_OLA_LVL_ERR, "FAILED to enable id %d\n", pf_cfg->id);
            }
            else
            {
                OL_LOG_PF(LOG_OLA_LVL_INFO, "Activating id %d for WAKE operation\n", pf_cfg->id);
            }
        }
    }
#endif /* USE_HW */

    cylpa_dump_filters_stats(ctxt->whd, ctxt->cfg);

    return RESULT_OK;
}

/*******************************************************************************
 * Function Name: cylpa_pf_ol_deinit
 ****************************************************************************//**
 *
 * Remove all filters. No need to disable prior to removal.
 *
 * \param ol
 * The pointer to the ol structure.
 *
 ********************************************************************************/
static void cylpa_pf_ol_deinit(void *ol)
{
    pf_ol_t *ctxt = (pf_ol_t *)ol;
    cy_pf_ol_cfg_t *pf_cfg;

    if ((ctxt == NULL) || (ctxt->cfg == NULL) || (ctxt->whd == NULL))
    {
        return;
    }

