Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lpa/source/cy_lpa_wifi_pf_ol.c
    for (pf_cfg = ctxt->cfg; pf_cfg->feature != CY_PF_OL_FEAT_LAST; pf_cfg++)
    {
        OL_LOG_PF(LOG_OLA_LVL_INFO, "Removing filter %d\n", pf_cfg->id);
#ifdef USE_HW
        whd_result_t res = whd_pf_remove_packet_filter(ctxt->whd, pf_cfg->id);
        if (res != WHD_SUCCESS)
        {
            OL_LOG_PF(LOG_OLA_LVL_ERR, "%s: Unable to remove filter %d, result = %d\n", __func__, pf_cfg->id, res);
        }
#endif
    }
}

/*******************************************************************************
 * Function Name: cylpa_pf_ol_pm
 ****************************************************************************//**
 *
 * Remove all filters. No need to disable prior to removal.
 *
 * \param ol
 * The pointer to the ol structure.
 *
 * \param st
 * see \ref ol_pm_st_t.
 *
 ********************************************************************************/
static void cylpa_pf_ol_pm(void *ol, ol_pm_st_t st)
{
    pf_ol_t *ctxt = (pf_ol_t *)ol;
    cy_pf_ol_cfg_t *pf_cfg;

    if ((ctxt == NULL) || (ctxt->cfg == NULL) || (ctxt->whd == NULL))
    {
        OL_LOG_PF(LOG_OLA_LVL_ERR, "%s : Bad Args!\n", __func__);
        return;
    }
#ifdef USE_HW
    switch (st)
    {
        case OL_PM_ST_GOING_TO_SLEEP:
            OL_LOG_PF(LOG_OLA_LVL_DEBUG, "%s: Entering sleep\n", __func__);
            break;
        case OL_PM_ST_AWAKE:
            OL_LOG_PF(LOG_OLA_LVL_DEBUG, "%s: Entering wake\n", __func__);
            break;
        default:
            OL_LOG_PF(LOG_OLA_LVL_DEBUG, "%s: Unknown state change\n", __func__);
            break;
    }
#endif /* USE_HW */

    for (pf_cfg = ctxt->cfg; pf_cfg->feature != CY_PF_OL_FEAT_LAST; pf_cfg++)
    {
        /* If always active, then nothing to do. */
        if ( (pf_cfg->bits & (CY_PF_ACTIVE_SLEEP | CY_PF_ACTIVE_WAKE) ) == (CY_PF_ACTIVE_SLEEP | CY_PF_ACTIVE_WAKE) )
        {
            OL_LOG_PF(LOG_OLA_LVL_INFO, "%s: Filter %d is always on, nothing to do\n", __func__, pf_cfg->id);
        }
        else
        {
#ifdef USE_HW
            switch (st)
            {
                case OL_PM_ST_GOING_TO_SLEEP:
                    if (pf_cfg->bits & CY_PF_ACTIVE_SLEEP)
                    {
                        OL_LOG_PF(LOG_OLA_LVL_DEBUG, "%s: Enabling sleep filter %d\n", __func__, pf_cfg->id);
                        if (whd_pf_enable_packet_filter(ctxt->whd, pf_cfg->id) != WHD_SUCCESS)
                        {
                            OL_LOG_PF(LOG_OLA_LVL_ERR, "%s: whd_pf_enable_packet_filter %d FAILED\n", __func__,
                                      pf_cfg->id);
                        }
                    }
                    else
                    {
                        OL_LOG_PF(LOG_OLA_LVL_DEBUG, "%s: Disabling wake filter %d\n", __func__, pf_cfg->id);
                        if (whd_pf_disable_packet_filter(ctxt->whd, pf_cfg->id) != WHD_SUCCESS)
                        {
                            OL_LOG_PF(LOG_OLA_LVL_ERR, "%s: whd_pf_disable_packet_filter %d FAILED\n", __func__,
                                      pf_cfg->id);
                        }
                    }
                    break;
                case OL_PM_ST_AWAKE:
                    if (pf_cfg->bits & CY_PF_ACTIVE_WAKE)
                    {
                        OL_LOG_PF(LOG_OLA_LVL_DEBUG, "%s: Enabling wake filter %d\n", __func__, pf_cfg->id);
                        if (whd_pf_enable_packet_filter(ctxt->whd, pf_cfg->id) != WHD_SUCCESS)
                        {
                            OL_LOG_PF(LOG_OLA_LVL_ERR, "%s: whd_pf_enable_packet_filter %d FAILED\n", __func__,
                                      pf_cfg->id);
                        }
                    }
                    else
                    {
                        OL_LOG_PF(LOG_OLA_LVL_DEBUG, "%s: Disabling sleep filter %d\n", __func__, pf_cfg->id);
                        if (whd_pf_disable_packet_filter(ctxt->whd, pf_cfg->id) != WHD_SUCCESS)
                        {
                            OL_LOG_PF(LOG_OLA_LVL_ERR, "%s: whd_pf_disable_packet_filter %d FAILED\n", __func__,
                                      pf_cfg->id);
                        }
                    }
                    break;
                default:
                    OL_LOG_PF(LOG_OLA_LVL_ERR, "Unknown PM state! %d\n", st);
                    break;
            }
#endif /* USE_HW */
        }  /* if !(SLEEP && WAKE) */
    }  /* for each configuration */
}

/* The number of bytes between the start of the 'EtherType' of the ethernet
 * header, and the end of the 'Destination port' of the UDP header is 26 (PORT_FILTER_LEN). */

/* The 'EtherType' field is 12 bytes from the start of the ethernet header. */
#define ETHTYPE_OFFSET 12

#ifdef USE_HW
static uint8_t cylpa_glob_pat_buf[32];
static uint8_t cylpa_glob_mask_buf[32];
#endif

#ifdef USE_HW
/*******************************************************************************
 * Function Name: common_filter_attrs
 ****************************************************************************//**
 * Handle common attributes of all filters
 * \param pf_cfg
 * The pointer to the cy_pf_ol_cfg_t structure \ref cy_pf_ol_cfg_t.
 * \param filter
 * Pointer to actual filter
 * \return
 * Returns the execution result
 ********************************************************************************/
static void common_filter_attrs(cy_pf_ol_cfg_t *pf_cfg, whd_packet_filter_t *filter)
{
    if ( (pf_cfg->bits & (CY_PF_ACTIVE_WAKE | CY_PF_ACTIVE_SLEEP) ) == 0 )
    {
        OL_LOG_PF(LOG_OLA_LVL_DEBUG, "ID %d: Neither Sleep nor Wake specified...will not be enabled\n", pf_cfg->id);
    }
    else
    {
        OL_LOG_PF(LOG_OLA_LVL_DEBUG, " %s%s",
                  pf_cfg->bits & CY_PF_ACTIVE_WAKE ? "Wake" : "",
                  pf_cfg->bits & CY_PF_ACTIVE_SLEEP ? "Sleep" : "");
        OL_LOG_PF(LOG_OLA_LVL_DEBUG, ", ");
    }

    if (pf_cfg->bits & CY_PF_ACTION_DISCARD)
    {
        filter->rule = WHD_PACKET_FILTER_RULE_NEGATIVE_MATCHING;
        OL_LOG_PF(LOG_OLA_LVL_DEBUG, "Discard\n");
    }
    else
    {
        filter->rule = WHD_PACKET_FILTER_RULE_POSITIVE_MATCHING;
        OL_LOG_PF(LOG_OLA_LVL_DEBUG, "Keep\n");
    }
}

#endif

