Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lpa/source/cy_lpa_wifi_pf_ol.c
/*******************************************************************************
 * Function Name: cylpa_create_ip_filter
 ****************************************************************************//**
 *
 * Remove all filters. No need to disable prior to removal.
 *
 * \param whd
 * The pointer to the whd interface.
 *
 * \param pf_cfg
 * The pointer to the cy_pf_ol_cfg_t structure \ref cy_pf_ol_cfg_t.
 *
 * \return
 * Returns the execution result
 *
 ********************************************************************************/
static int cylpa_create_ip_filter(whd_t *whd, cy_pf_ol_cfg_t *pf_cfg)
{
#ifdef USE_HW
    whd_packet_filter_t filter;

    struct ether_header ether_hdr_mask;
    struct ether_header ether_hdr_pattern;
    struct ipv4_hdr ip_hdr_mask;
    struct ipv4_hdr ip_hdr_pattern;

    uint8_t *pat_ptr = cylpa_glob_pat_buf;
    uint8_t *mask_ptr = cylpa_glob_mask_buf;

    memset(&ether_hdr_pattern, 0, sizeof(ether_hdr_pattern) );
    memset(&ether_hdr_mask, 0, sizeof(ether_hdr_mask) );
    memset(&ip_hdr_pattern, 0, sizeof(ip_hdr_pattern) );
    memset(&ip_hdr_mask, 0, sizeof(ip_hdr_mask) );

    ether_hdr_pattern.ether_type = hton16(ETHER_TYPE_IP);
    ether_hdr_mask.ether_type = hton16(0xffff);

    ip_hdr_mask.prot = 0xff;
    ip_hdr_pattern.prot = pf_cfg->u.ip.ip_type;

    filter.id = pf_cfg->id;
    filter.offset = ETHTYPE_OFFSET;
    filter.mask = (uint8_t *)cylpa_glob_mask_buf;
    filter.pattern = (uint8_t *)cylpa_glob_pat_buf;
    filter.mask_size = ETHER_TYPE_LEN + sizeof(ip_hdr_pattern);

    memcpy(mask_ptr, &ether_hdr_mask.ether_type, ETHER_TYPE_LEN);
    memcpy(mask_ptr + ETHER_TYPE_LEN, &ip_hdr_mask, sizeof(ip_hdr_mask) );

    memcpy(pat_ptr, &ether_hdr_pattern.ether_type, ETHER_TYPE_LEN);
    memcpy(pat_ptr + ETHER_TYPE_LEN, &ip_hdr_pattern, sizeof(ip_hdr_pattern) );

    OL_LOG_PF(LOG_OLA_LVL_DEBUG, "Creating IP filter %d: ", pf_cfg->id);
    common_filter_attrs(pf_cfg, &filter);

    if (whd_pf_add_packet_filter(whd, &filter) != WHD_SUCCESS)
    {
        OL_LOG_PF(LOG_OLA_LVL_ERR, "Add filter %ld Failed\n", filter.id);
    }
#endif /* USE_HW */
    return 0;
}

/*******************************************************************************
 * Function Name: cylpa_create_ethtype_filter
 ****************************************************************************//**
 *
 * Remove all filters. No need to disable prior to removal.
 *
 * \param whd
 * The pointer to the whd interface.
 *
 * \param pf_cfg
 * The pointer to the cy_pf_ol_cfg_t structure \ref cy_pf_ol_cfg_t.
 *
 * \return
 * Returns the execution result
 *
 ********************************************************************************/
static int cylpa_create_ethtype_filter(whd_t *whd, cy_pf_ol_cfg_t *pf_cfg)
{
#ifdef USE_HW
    whd_packet_filter_t filter;

    struct ether_header ether_hdr_mask;
    struct ether_header ether_hdr_pattern;

    uint8_t *pat_ptr = cylpa_glob_pat_buf;
    uint8_t *mask_ptr = cylpa_glob_mask_buf;

    uint16_t eth = pf_cfg->u.eth.eth_type;

    memset(&ether_hdr_pattern, 0, sizeof(ether_hdr_pattern) );
    memset(&ether_hdr_mask, 0, sizeof(ether_hdr_mask) );

    ether_hdr_pattern.ether_type = hton16(eth);
    ether_hdr_mask.ether_type = hton16(0xffff);

    filter.id = pf_cfg->id;
    filter.offset = ETHTYPE_OFFSET;
    filter.mask = (uint8_t *)cylpa_glob_mask_buf;
    filter.pattern = (uint8_t *)cylpa_glob_pat_buf;
    filter.mask_size = ETHER_TYPE_LEN;

    OL_LOG_PF(LOG_OLA_LVL_DEBUG, "Creating EtherType filter: ID %d", pf_cfg->id);
    common_filter_attrs(pf_cfg, &filter);

    memcpy(mask_ptr, &ether_hdr_mask.ether_type, ETHER_TYPE_LEN);
    memcpy(pat_ptr, &ether_hdr_pattern.ether_type, ETHER_TYPE_LEN);

    if (whd_pf_add_packet_filter(whd, &filter) != WHD_SUCCESS)
    {
        OL_LOG_PF(LOG_OLA_LVL_ERR, "Add filter %ld Failed\n", filter.id);
    }
#endif /* USE_HW */
    return 0;
}

/*******************************************************************************
 * Function Name: cylpa_create_port_filter
 ****************************************************************************//**
 *
 * Remove all filters. No need to disable prior to removal.
 *
 * \param whd
 * The pointer to the whd interface.
 *
 * \param pf_cfg
 * The pointer to the cy_pf_ol_cfg_t structure \ref cy_pf_ol_cfg_t.
 *
 * \param pattern
 * The pointer to the ol structure.
 *
 * \param mask
 * The pointer to the ol_info_t structure.
 *
 * \return
 * Returns the execution result
 *
 ********************************************************************************/
static int cylpa_create_port_filter(whd_t *whd, cy_pf_ol_cfg_t *pf_cfg, uint16_t pattern, uint16_t mask)
{
#ifndef USE_HW
    OL_LOG_PF(LOG_OLA_LVL_DEBUG, "Creating filter for Pattern 0x%x, Mask 0x%x, Active during: %s %s\n",
              pattern, mask,
              pf_cfg->bits & CY_PF_ACTIVE_WAKE ? "Wake " : "",
              pf_cfg->bits & CY_PF_ACTIVE_SLEEP ? "Sleep " : "");
#else
    whd_packet_filter_t filter;
    struct ether_header ether_hdr_mask;
    struct ether_header ether_hdr_pattern;
    struct bcmudp_hdr udp_hdr_mask;
    struct bcmudp_hdr udp_hdr_pattern;
    struct ipv4_hdr ip_hdr_mask;
    struct ipv4_hdr ip_hdr_pattern;
    uint8_t *pat_ptr = cylpa_glob_pat_buf;
    uint8_t *mask_ptr = cylpa_glob_mask_buf;

    /* Configure pattern to match against received packets. */
    memset(&ether_hdr_pattern, 0, sizeof(ether_hdr_pattern) );
    memset(&udp_hdr_pattern, 0, sizeof(udp_hdr_pattern) );
    memset(&ip_hdr_pattern, 0, sizeof(ip_hdr_pattern) );

    /* Configure bitmask that indicates which bits of received packets to match * against specified pattern. */
    memset(&ether_hdr_mask, 0, sizeof(ether_hdr_mask) );
    memset(&udp_hdr_mask, 0, sizeof(udp_hdr_mask) );
    memset(&ip_hdr_mask, 0, sizeof(ip_hdr_mask) );

    /* Ethernet header. Validate that 'EtherType' is IP. */
    ether_hdr_pattern.ether_type = hton16(ETHER_TYPE_IP);
    ether_hdr_mask.ether_type = hton16(0xffff);

    /* IP header. Validate that 'Protocol' is UDP. */
    ip_hdr_mask.prot = 0xff;
    ip_hdr_pattern.prot = pf_cfg->u.pf.proto;

    switch (pf_cfg->u.pf.proto)
    {
        case CY_PF_PROTOCOL_UDP:
            ip_hdr_pattern.prot = IP_PROTO_UDP;
            break;
        case CY_PF_PROTOCOL_TCP:
            ip_hdr_pattern.prot = IP_PROTO_TCP;
            break;
        default:
            ip_hdr_pattern.prot = IP_PROTO_TCP;
            break;
    }

    /* Set port number pattern and mask */
    if (pf_cfg->u.pf.portnum.direction == PF_PN_PORT_SOURCE)
    {
        OL_LOG_PF(LOG_OLA_LVL_DEBUG, "Source Port, ");
        udp_hdr_pattern.src_port = hton16(pattern);
        udp_hdr_mask.src_port = hton16(mask);
    }
    else
    {
        OL_LOG_PF(LOG_OLA_LVL_DEBUG, "Dest Port, ");
        udp_hdr_pattern.dst_port = hton16(pattern);
        udp_hdr_mask.dst_port = hton16(mask);
    }

    common_filter_attrs(pf_cfg, &filter);

    filter.id = pf_cfg->id;
    filter.offset = ETHTYPE_OFFSET;
    filter.mask = (uint8_t *)cylpa_glob_mask_buf;
    filter.pattern = (uint8_t *)cylpa_glob_pat_buf;
    filter.mask_size = PORT_FILTER_LEN;

    memcpy(mask_ptr, &ether_hdr_mask.ether_type, ETHER_TYPE_LEN);
    memcpy(mask_ptr + ETHER_TYPE_LEN, &ip_hdr_mask, sizeof(ip_hdr_mask) );
    memcpy(mask_ptr + ETHER_TYPE_LEN + sizeof(ip_hdr_mask), &udp_hdr_mask, sizeof(udp_hdr_mask) );


    memcpy(pat_ptr, &ether_hdr_pattern.ether_type, ETHER_TYPE_LEN);
    memcpy(pat_ptr + ETHER_TYPE_LEN, &ip_hdr_pattern, sizeof(ip_hdr_pattern) );
    memcpy(pat_ptr + ETHER_TYPE_LEN + sizeof(ip_hdr_pattern), &udp_hdr_pattern, sizeof(udp_hdr_pattern) );

#ifdef DEBUG
    OL_LOG_PF(LOG_OLA_LVL_INFO, "Before add_packet_filter()\n");
    cylpa_print_pat_and_mask(filter.id, PORT_FILTER_LEN, cylpa_glob_mask_buf, cylpa_glob_pat_buf);
#endif

    if (whd_pf_add_packet_filter(whd, &filter) != WHD_SUCCESS)
    {
        OL_LOG_PF(LOG_OLA_LVL_ERR, "Add filter %ld Failed\n", filter.id);
    }
#endif /* USE_HW */

