Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lpa/source/cy_lpa_wifi_pf_ol.c
    return 0;
}

/*******************************************************************************
 * Function Name: cylpa_create_single_portnum_mask
 ****************************************************************************//**
 *
 * Remove all filters. No need to disable prior to removal.
 *
 * \param pf_cfg
 * The pointer to the cy_pf_ol_cfg_t structure \ref cy_pf_ol_cfg_t.
 *
 * \param pattern
 * TBD.
 *
 * \param mask
 * TBD.
 *
 * \return
 * Returns the execution result
 *
 ********************************************************************************/
static int cylpa_create_single_portnum_mask(cy_pf_ol_cfg_t *pf_cfg, uint16_t *pattern, uint16_t *mask)
{
    *pattern = pf_cfg->u.pf.portnum.portnum;
    *mask = 0xffff;
    return 0;
}

/*******************************************************************************
 * Function Name: cylpa_create_portnum_range_mask
 ****************************************************************************//**
 *
 * Remove all filters. No need to disable prior to removal.
 *
 * \param pf_cfg
 * The pointer to the cy_pf_ol_cfg_t structure \ref cy_pf_ol_cfg_t.
 *
 * \param pattern
 * TBD.
 *
 * \param mask
 * TBD.
 *
 * \return
 * Returns the execution result
 *
 ********************************************************************************/
static int cylpa_create_portnum_range_mask(cy_pf_ol_cfg_t *pf_cfg, uint16_t *pattern, uint16_t *mask)
{
    uint16_t port = pf_cfg->u.pf.portnum.portnum;
    uint16_t range = pf_cfg->u.pf.portnum.range;

    /* initialize filter patterns */
    *pattern = port;

    /*
     * Say using port = 64 and  range = 3. Translates into binary:  100 0000 thru 100 0011
     *   Pattern: Use port number for pattern (100 0000)
     *   Mask:    Need to invert low bits, and fill 0s between resulting 1s.
     *             To invert low bits, subtract 1.
     *             OR the port back in since it was removed by the -1.
     *       Example mask: convert 100 0011 into 111 1100
     */
    *mask = ( ( (port - 1) ^ range ) | port );

    /* Now sign extend all the way to the leftmost/highest bit
     * to prevent false hits on high bits
     */
    *mask = cylpa_sign_extend(*mask, cylpa_bitwidth(*mask) );

    return 0;
}

static int cylpa_sign_extend(int val, unsigned width)
{
    int const mask = 1U << (width - 1);

    val = val & ( (1U << width) - 1 );
    return ( (val ^ mask) - mask );
}

/* Return position of set bit using 1 based notation */
static int cylpa_bitwidth(int val)
{
    int pos;
    for (pos = MAX_BITS_IN_PORTNUM - 1; pos >= 0; pos--)
    {
        if (val & (1 << pos) )
        {
            return (pos + 1);
        }
    }
    return -1;
}

#ifdef TESTING
/* Simulate FW using the pattern and mask */
static void cylpa_run_pf_test(unsigned int pattern, unsigned int mask)
{
    int i;
    if (!pattern)
    {
        return;
    }

    for (i = 0; i < 65000; i++)
    {
        if ( (i & mask) == pattern )
        {
            OL_LOG_PF(LOG_OLA_LVL_INFO, "%d\n", i);
        }
    }
}

#endif

/* Bug in FW? doesn't allow us to retrieve filter patterns after enabling.
 * dump_patterns controls this.
 */
static int cylpa_dump_filters_stats(whd_t *whd, cy_pf_ol_cfg_t *base_pf_cfg)
{
#ifdef USE_HW
    cy_pf_ol_cfg_t *pf_cfg;
    OL_LOG_PF(LOG_OLA_LVL_ERR, "\n");
    OL_LOG_PF(LOG_OLA_LVL_ERR, "               \t Total    Total\n");
    OL_LOG_PF(LOG_OLA_LVL_ERR, "ID:   Matched  \tSent Up  Dropped\n");

    for (pf_cfg = base_pf_cfg; pf_cfg->feature != CY_PF_OL_FEAT_LAST; pf_cfg++)
    {
        cylpa_print_packet_filter_stats(whd, pf_cfg->id);
    }
#endif /* USE_HW */
    return 0;
}

#ifdef USE_HW
#ifdef DEBUG
static void cylpa_print_pat_and_mask(uint8_t id, int mask_len, uint8_t *mask, uint8_t *pat)
{
    int b;
    OL_LOG_PF(LOG_OLA_LVL_ERR, "ID: %d\n", id);
    OL_LOG_PF(LOG_OLA_LVL_ERR, "      Mask: ");
    b = mask_len;
    while (b > 0)
    {
        OL_LOG_PF(LOG_OLA_LVL_ERR, "%02x ", *mask);
        mask++;
        b--;
    }

    OL_LOG_PF(LOG_OLA_LVL_ERR, "\n");
    OL_LOG_PF(LOG_OLA_LVL_ERR, "     Value: ");
    b = mask_len;
    while (b > 0)
    {
        OL_LOG_PF(LOG_OLA_LVL_ERR, "%02x ", *pat);
        pat++;
        b--;
    }
    OL_LOG_PF(LOG_OLA_LVL_ERR, "\n");
}

#endif /* DEBUG */

/* Query and print stats from each filter */
static int cylpa_print_packet_filter_stats(whd_t *whd, uint8_t filter_id)
{
    whd_result_t status;
    wl_pkt_filter_stats_t stats;

    status = whd_pf_get_packet_filter_stats(whd, filter_id, &stats);
    if (status != WHD_SUCCESS)
    {
        OL_LOG_PF(LOG_OLA_LVL_ERR, "Failure Getting Packet Filter Statistics 0x%x\n", status);
        return status;
    }

    OL_LOG_PF(LOG_OLA_LVL_ERR, " %u:   %u \t%u \t%u\n",
              (unsigned int)filter_id, (unsigned int)stats.num_pkts_matched,
              (unsigned int)stats.num_pkts_forwarded, (unsigned int)stats.num_pkts_discarded);

    return status;
}

#endif /* USE_HW */

#ifdef __cplusplus
}
#endif

